app/controllers/rankcriterias_controller.rb

  def rankedtickets

    @rankcriterias = Rankcriteria.find(:all)

    Ticket.count_by_sql("update tickets set rank=0")

    @rankcriterias.each do |rankcriteria|

      @tickets = Ticket.find(:all, :conditions => "title ~* '#{rankcriteria.phrase}' or description ~* '#{rankcriteria.phrase}'")

      @tickets.each do |tkt|
---
SELECT * FROM "rankcriterias"
SELECT * FROM "tickets" WHERE (title ~* 'bad' or description ~* 'bad')
SELECT * FROM "tickets" ORDER BY rank desc

  def index
    @rankcriterias = Rankcriteria.all
---
SELECT * FROM "rankcriterias"

  def show
    @rankcriteria = Rankcriteria.find(params[:id])
---
SELECT * FROM "rankcriterias" WHERE ("rankcriterias"."id" = 1)

  def edit
    @rankcriteria = Rankcriteria.find(params[:id])
---
SELECT * FROM "rankcriterias" WHERE ("rankcriterias"."id" = 1)

  def create
    @rankcriteria = Rankcriteria.new(params[:rankcriteria])
    spellcheck = Spellcheck.new
    @wrongword = @rankcriteria.phrase
    if @rankcriteria.phrase.strip.split(' ').length < 2
      @result = spellcheck.check_word(@rankcriteria.phrase)
      unless @result["spellresult"]["c"].nil?
          #puts @result["spellresult"]["c"]["@l"] #length
          #puts @result["spellresult"]["c"]["$"]
          #@result["spellresult"]["c"]["$"] #strings
          #@result["spellresult"]["c"]["$"].to_s.split(/\t/)
        render :new
      else
        syn = Antonyms.new
        result = syn.get_antonyms(@rankcriteria.phrase)
        result["words"]["w"].each do |key|
          criteria = Rankcriteria.new
          criteria.phrase = key["$"].to_s
          if key["@r"].to_s.downcase == "ant"
            criteria.priorityhigh=true
          else
            criteria.priorityhigh=false
          end
          criteria.save
---
SELECT "rankcriterias".id FROM "rankcriterias" WHERE ("rankcriterias"."phrase" = 'good') LIMIT 1
INSERT INTO "rankcriterias" ("phrase", "priorityhigh", "created_at", "updated_at") VALUES('hate', 't', '2010-11-23 07:11:29.178735', '2010-11-23 07:11:29.178735') RETURNING "id"

  def update
    @rankcriteria = Rankcriteria.find(params[:id])
    respond_to do |format|
      if @rankcriteria.update_attributes(params[:rankcriteria])
---
SELECT * FROM "rankcriterias" WHERE ("rankcriterias"."id" = 5)
UPDATE "rankcriterias" SET "phrase" = 'I like', "priorityhigh" = 't', "updated_at" = '2010-11-23 11:59:47.760429' WHERE "id" = 5

  def destroy
    @rankcriteria = Rankcriteria.find(params[:id])
    @rankcriteria.destroy
---
SELECT * FROM "rankcriterias" WHERE ("rankcriterias"."id" = 9)
DELETE FROM "rankcriterias" WHERE "id" = 9