app/controllers/tickets_controller.rb

SELECT * FROM "tickets" WHERE (title ~* 'asdsdf' or description ~* 'asdsdf')
---
  def ratings

       criteria = params[:criteria]

       unless criteria.nil?

           @tickets = Ticket.find(:all, :conditions => "title ~* '#{criteria}' or description ~* '#{criteria}'")

SELECT * FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT * FROM "tickets" WHERE ("tickets"."id" = 1)
---
  def show
    @ticket = Ticket.find(params[:id])

SELECT * FROM "tickets" WHERE ("tickets"."id" = 2)
---
  def edit
    @ticket = Ticket.find(params[:id])

INSERT INTO "tickets" ("title", "description", "rank", "created_at", "updated_at") VALUES('Sample ticket', 'I dont like to create a ticket using interface', NULL, '2010-11-23 10:26:27.956139', '2010-11-23 10:26:27.956139') RETURNING "id"
---
  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save

SELECT * FROM "tickets" WHERE ("tickets"."id" = 4)
UPDATE "tickets" SET "description" = 'this is irritating and bad, not bad', "updated_at" = '2010-11-23 11:37:03.691409' WHERE "id" = 4
---
  def update
    @ticket = Ticket.find(params[:id])

    respond_to do |format|
      if @ticket.update_attributes(params[:ticket])